trungnguyen278/PNOID/stm32_pnoid/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define K1_Pin GPIO_PIN_3
#define K1_GPIO_Port GPIOE
#define LED_D2_Pin GPIO_PIN_1
#define LED_D2_GPIO_Port GPIOA
#define CAM_PWDN_Pin GPIO_PIN_7
#define CAM_PWDN_GPIO_Port GPIOA
#define CAM_RESET_Pin GPIO_PIN_4
#define CAM_RESET_GPIO_Port GPIOC
#define K2_Pin GPIO_PIN_5
#define K2_GPIO_Port GPIOC
#define LCD_BLK_Pin GPIO_PIN_0
#define LCD_BLK_GPIO_Port GPIOB
#define LCD_D_C_Pin GPIO_PIN_1
#define LCD_D_C_GPIO_Port GPIOB
#define BNO_INT_Pin GPIO_PIN_7
#define BNO_INT_GPIO_Port GPIOE
#define BNO_INT_EXTI_IRQn EXTI9_5_IRQn
#define BNO_RST_Pin GPIO_PIN_8
#define BNO_RST_GPIO_Port GPIOE
#define SPI4_CS_Pin GPIO_PIN_11
#define SPI4_CS_GPIO_Port GPIOE
#define LCD_CS_Pin GPIO_PIN_12
#define LCD_CS_GPIO_Port GPIOB
#define MUX_S4_Pin GPIO_PIN_8
#define MUX_S4_GPIO_Port GPIOD
#define MUX_S0_Pin GPIO_PIN_4
#define MUX_S0_GPIO_Port GPIOD
#define MUX_S1_Pin GPIO_PIN_5
#define MUX_S1_GPIO_Port GPIOD
#define MUX_S2_Pin GPIO_PIN_6
#define MUX_S2_GPIO_Port GPIOD
#define MUX_S3_Pin GPIO_PIN_7
#define MUX_S3_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
